a = "AppliedMathematics"
print("****", a, "****")
print("Πρώτοι έξι χαρακτήρες:", a[:6])
print("Τελευταίοι πέντε χαρακτήρες:", a[-5:])
print("Κάθε δεύτερο χαρακτήρα ξεκινώντας απο τη θέση 3")
for c in range(2, len(a), 2):
    print(a[c], end="")
print("")
print("Ολους τους χαρακτήρες ξεκινώντας απο τον δεύτερο απο το τέλος και προχωρώντας προς την αρχή")
for c in range(len(a)-2, 0,-1):
    print(a[c], end="")
print("")
print("Μία ακολουθία αποτελούμενη απο τους χαρακτήρες στις άρτιες θέσεις, ακολουθούμενη απο τους χαρακτήρες στις περιττές θέσεις")
for c in range(0, len(a), 2):
    print(a[c], end="")
for c in range(1, len(a), 1):
    print(a[c], end="")
print("")



